{"meta":{"title":"Begin","subtitle":"something simple!","description":null,"author":"Yummy","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"WordPress removes several alt-right blogs that spread Sandy Hook conspiracies","slug":"WordPress-removes-several-alt-right-blogs-that-spread-Sandy-Hook-conspiracies","date":"2018-08-18T05:28:47.000Z","updated":"2018-08-18T07:20:53.592Z","comments":true,"path":"2018/08/18/WordPress-removes-several-alt-right-blogs-that-spread-Sandy-Hook-conspiracies/","link":"","permalink":"http://yoursite.com/2018/08/18/WordPress-removes-several-alt-right-blogs-that-spread-Sandy-Hook-conspiracies/","excerpt":"How did it happen?","text":"How did it happen? WordPress has taken down several alt-right blogs, citing a new policy that bans blogs from the “malicious publication of unauthorized, identifying images of minors.” The change has led to the shutdown of several blogs that spread conspiracies about the 2012 Sandy Hook school shooting, as spotted by TechCrunch. Now alt-right bloggers and readers claim several sites have been removed, including conspiracies about Sandy Hook and 9/11. The timing of the move comes just after the New York Times reported on how WordPress was still allowing these bloggers to stay online. WordPress’ Terms of Service is filled with loopholes for abusers Previously, that content was left up as it didn’t directly violate WordPress’ Terms of Service, which doesn’t state how to deal with false information on the platform. Even though the content was flagged as false, there had been no consequences, as WordPress’ ToS focuses on copyright issues and account security more than the integrity of content. Essentially, WordPress’ ToS is filled with loopholes for abusers to spread misinformation. Parents of Sandy Hook victims sued WordPress Parents of Sandy Hook victims had little choice but to use the copyright terms to try and sue WordPress into removing the images of their children. WordPress responded with what it later told the Times was a prewritten statement saying it could seek damages against the parents in response to the copyright complaints. At the time, the company maintained its position that the conspiracy posts were allowed. WordPress’ stance is reminiscent of how other social media platforms are currently under fire for arbitrarily determining what policies to enforce and whether to police horrific misinformation or leave it standing. As these issues gain attention, many platforms are putting new measures in place to remove abusive content, but like WordPress, their initial legal groundwork could use more scrutiny.","categories":[],"tags":[]},{"title":"The best battery packs for carrying everywhere and charging everything","slug":"The-best-battery-packs-for-carrying-everywhere-and-charging-everything","date":"2018-08-18T05:28:19.000Z","updated":"2018-08-18T06:26:05.419Z","comments":true,"path":"2018/08/18/The-best-battery-packs-for-carrying-everywhere-and-charging-everything/","link":"","permalink":"http://yoursite.com/2018/08/18/The-best-battery-packs-for-carrying-everywhere-and-charging-everything/","excerpt":"An essential item that belongs in your bag","text":"An essential item that belongs in your bag Battery packs (also called power banks) are an essential purchase these days. Smartphone makers continue to prioritize shrinking down a device’s dimensions and thickness instead of extending the endurance and longevity we get out of our expensive handsets, but battery packs can augment the phone’s own power and offer some peace of mind. Modern battery capacity ranges anywhere from 1,821mAh in the iPhone 8 to 4,000mAh in the new Galaxy Note 8. But even a big number doesn’t always guarantee your phone will comfortably last into a second day of texting, web browsing, swiping through Instagram, streaming Spotify, watching YouTube, and whatever else you do. Taken off the charger in the morning, most phones can make it through a typical day with some power to spare, but unfortunately you really can’t count on more than that. By now our battery week coverage has made clear that lithium ion batteries aren’t radically evolving or getting replaced anytime soon. So if you know you’re going to have a long day away from a power outlet, it’s time to put a battery pack in your bag. Smartphones support a variety of charging speeds, standards, and ports depending on manufacturer and how recently they were released. If you’ve got an iPhone, it’s the Lightning jack. Newer Android phones should have a USB Type C port. Some power banks like the Jackery Bolt have integrated charging cables for convenience, but I don’t like ‘em. If the integrated cord frays or breaks in some other way, it’s dead weight and useless. Plus, a lot of them still include a MicroUSB cable instead of USB-C, which might be handy for accessories like wireless headphones, but won’t do any good for your 2018 phone. So for the purpose of this roundup, I focused on good old battery packs with ports that’ll accept whatever cable you’ve already got. Finally, batteries are definitely one product category where you need to trust the brand you’re buying from. I’d avoid the bottom-dollar Amazon brands for this one; thankfully our picks are all relatively affordable.","categories":[],"tags":[]},{"title":"Watch the first trailer for Star Wars Resistance","slug":"Watch-the-first-trailer-for-Star-Wars-Resistance","date":"2018-08-18T05:27:47.000Z","updated":"2018-08-18T05:28:00.728Z","comments":true,"path":"2018/08/18/Watch-the-first-trailer-for-Star-Wars-Resistance/","link":"","permalink":"http://yoursite.com/2018/08/18/Watch-the-first-trailer-for-Star-Wars-Resistance/","excerpt":"","text":"Disney’s next animated Star Wars show just got its first trailer, and it’s looking like a light-hearted adventure about becoming a resistance pilot. As originally announced earlier this year, Resistance is being helmed by Clone Wars and Rebels veteran Dave Filoni and stars Kazuda Xiono, a emotive newbie who seems a little over his head. The show’s one-hour premiere — which will air on Disney Channel, DisneyNOW, and Disney Channel VOD, with subsequent airings on Disney XD, on October 7th — kicks off at the start of Xiono’s mission to spy on the First Order on a planet full of new aliens. Xiono — who bears an uncanny resemblance to Bolin from The Legend of Korra — happens to live with a friend of Poe Dameron (Oscar Isaac voices), so you should expect to see some familiar faces mixed in with totally new characters. The resourceful BB-8, for example, seems to be Xiono’s companion throughout his adventures, which are set before the events of The Force Awakens. Based on the trailer, it looks like Resistance will be defined in part by its distinctive cel-shaded animation style inspired by anime. Once Disney’s streaming service finally gets up and running — the estimate is now at late 2019 — Resistance will be joined by the live-action series from Jon Favreau that was announced last fall, as well as the return of The Clone Wars, an additional 12-episode arc that got a surprise reveal at San Diego Comic-Con in July.","categories":[],"tags":[{"name":"news","slug":"news","permalink":"http://yoursite.com/tags/news/"}]},{"title":"Be careful what you believe about screen time making you blind","slug":"Be-careful-what-you-believe-about-screen-time-making-you-blind","date":"2018-08-18T05:13:01.000Z","updated":"2018-08-18T06:25:50.370Z","comments":true,"path":"2018/08/18/Be-careful-what-you-believe-about-screen-time-making-you-blind/","link":"","permalink":"http://yoursite.com/2018/08/18/Be-careful-what-you-believe-about-screen-time-making-you-blind/","excerpt":"","text":"If you believe the headlines that have been circulating over the past few weeks, staring at screens is ruining our eyes. “Blue light from phones, tablets could accelerate blindness and hurt vision, study finds,” USA Today declared. Only, that particular study didn’t actually test the blue light that comes out of screens — and it didn’t look at the light’s effects on actual eyeballs. We’ve been through this before: there is some evidence that blue light can disrupt your sleep schedule. And some research suggests blue light might damage rat retinas. But that doesn’t mean that the blue light from screens does the same thing to people — and ophthalmologist Rebecca Taylor told The Verge earlier this year that “the devices that we use do not appear to cause long-term eye damage.” It didn’t look at the light’s effects on actual eyeballs Still, there’s a new round of blue-light hysteria going on, and you can trace it back to a paper published last month in the journal Scientific Reports. It showed that a molecule that’s key for sensing light in the eye, called retinal, combined with blue light, can damage and kill cells. No wonder people are freaked out. So I asked the paper’s senior author, chemist Ajith Karunarathne at the University of Toledo in Ohio, whether his results mean that staring at my tablet or iPhone will make me go blind. His answer was simple: “Absolutely not.” What does this latest blue light study actually show? It’s more about how blue light could cause damage, rather than whether it actually does so in the eye itself. The whole thing started because Karunarathne’s lab studies how to make cells move in response to light the same way they move in response to the chemicals squirting around the body. “Have you seen those videos that show cats following a laser pointer on the ground?” Karunarathne asked. It’s kind of like that — just, smaller. Light’s easier to control than chemicals — and the idea is that if you can turn cell movement on and off with the flip of a switch, it might help scientists tease out how different cells contribute to complex biological processes. It’s like silencing the violins in an orchestra to see how important they are to the overall melody. To make cells responsive to light, the team basically added eye features to non-eye cells. They took the proteins that detect light in the eye, called photoreceptors, and tricked other types of cells — like, say, cancer cells — into producing them. Then, they added a key ingredient called retinal, a molecule that photoreceptors need in order to sense light. That’s when they discovered that blue light damaged or even killed these cells — and they set out to figure out why. The photoreceptors themselves didn’t seem to be to blame. So could it have been the retinal, combined with the blue light? The answer, according to their new Scientific Reports paper, is yes. But there are a bunch of key caveats here that are missing from some of the more breathless coverage. First off, those cells were in a dish, not an eyeball. And the cells included cancer cells, immune cells, and yes, a type of cell found in the eye. But while they showed one way that blue light can damage cells, Karunarathne says, “The question is whether it’s happening in the eye.” And that, they don’t know yet. It’ll take more research to figure out. “We haven’t done any experiments with the light coming out of digital devices, or any other digital screens,” Karunarathne says. “So, I have to limit our conclusions.” It’s a good idea for us to do the same.","categories":[],"tags":[{"name":"news","slug":"news","permalink":"http://yoursite.com/tags/news/"}]},{"title":"how to add an tags or categories?","slug":"how-to-add-an-tags-or-categories","date":"2018-08-18T02:34:21.000Z","updated":"2018-08-18T07:20:15.206Z","comments":true,"path":"2018/08/18/how-to-add-an-tags-or-categories/","link":"","permalink":"http://yoursite.com/2018/08/18/how-to-add-an-tags-or-categories/","excerpt":"this is a subtitle!","text":"this is a subtitle! If you want to add an tag such as Hexo and the categorie we choose is tutorial, just add some change like this 1234tags: - Hexocategories: - tutorial","categories":[{"name":"tutorial","slug":"tutorial","permalink":"http://yoursite.com/categories/tutorial/"}],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"http://yoursite.com/tags/Hexo/"}]},{"title":"Begin","slug":"Begin","date":"2018-08-17T13:39:26.000Z","updated":"2018-08-18T06:22:57.536Z","comments":true,"path":"2018/08/17/Begin/","link":"","permalink":"http://yoursite.com/2018/08/17/Begin/","excerpt":"开始","text":"开始 终于可以用了。 ！！！ 如下图 为了几个空格。。。 崩溃了","categories":[{"name":"start","slug":"start","permalink":"http://yoursite.com/categories/start/"}],"tags":[{"name":"begin","slug":"begin","permalink":"http://yoursite.com/tags/begin/"}]}]}