{"meta":{"title":"Begin","subtitle":"something simple!","description":"Since you can't control the luck itself, which is bound to come your way for better and for worse, what matters is your state of preparedness to deal with it.","author":"Yummy","url":"http://hijia.xin"},"pages":[{"title":"About","date":"2018-08-18T00:47:58.000Z","updated":"2018-08-20T07:57:29.309Z","comments":true,"path":"about/index.html","permalink":"http://hijia.xin/about/index.html","excerpt":"","text":"井蛙不可以语于海者，拘于虚也 夏虫不可以语于冰者，笃于时也"},{"title":"Categories","date":"2018-08-19T07:49:16.000Z","updated":"2018-08-19T08:00:49.488Z","comments":false,"path":"categories/index.html","permalink":"http://hijia.xin/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"Blockchain-based Machine Learning Marketplaces","slug":"Blockchain-based-Machine-Learning-Marketplaces","date":"2018-08-20T08:02:00.000Z","updated":"2018-08-20T08:02:24.432Z","comments":true,"path":"2018/08/20/Blockchain-based-Machine-Learning-Marketplaces/","link":"","permalink":"http://hijia.xin/2018/08/20/Blockchain-based-Machine-Learning-Marketplaces/","excerpt":"","text":"Blockchain-based Machine Learning MarketplacesSource Machine learning models trained on data from blockchain-based marketplaces have the potential to create the world’s most powerful artificial intelligences. They combine two potent primitives: private machine learning, which allows for training to be done on sensitive private data without revealing it, and blockchain-based incentives, which allow these systems to attract the best data and models to make them smarter. The result is open marketplaces where anyone can sell their data and keep their data private, while developers can use incentives to attract the best data for their algorithms to them. Constructing these systems is challenging and the requisite building blocks are still being created, but simple initial versions look like they are starting to become possible. I believe these marketplaces will transition us out of the current era of Web 2.0 data monopolies into a Web 3.0 era of open competition for data and algorithms, where both are directly monetized. OriginThe base of this idea came in 2015 from talking with Richard of Numerai. Numerai is a hedge fund that sends encrypted market data to any data scientist who wants to compete to model the stock market. Numerai combines the best model submissions into a “metamodel”, trades that metamodel, and pays data scientists whose models perform well. Having data scientists compete seemed like a powerful idea. So it got me thinking: can you create a fully decentralized version of this system that could be generalized to any problem? I believe the answer is yes. ConstructionAs an example, let’s try creating a fully decentralized system for trading cryptocurrencies on decentralized exchanges. This is one of many potential constructions: Data Data providers stake data and make it available to modelers. Model building Modelers choose what data to use and create models. Training is done using a secure computation method which allows models to be trained without revealing the underlying data. Models are staked as well. Metamodel building A metamodel is created based on an algorithm that takes into account the staking of each model. Creating a metamodel is optional — you can imagine models that are used without being combined into a metamodel. Using the metamodel A smart contract takes the metamodel and trades programmatically through decentralized exchange mechanisms on-chain. Distributing gains/losses After some time period passes, trading produces a profit or loss. This profit or loss is divided up amongst contributors to the metamodel based on how much smarter they made it. Models which contributed negatively have some or all of their staked funds taken. Models then turn around and perform similar distributions/stake slashing to their data providers. Verifiable computation Computation for each step is either performed centralized but verifiable and challengeable using a verification game like Truebit or decentralized using secure multiparty computation. Hosting Data and models are either hosted on IPFS or with nodes in a secure multiparty computation network, as on-chain storage would be too expensive. What makes this system powerful?Incentives to attract the best data globally Incentives to attract data are the most potent part of the system as data tends to be the limiting factor for most machine learning. In the same way Bitcoin created an emergent system with the most compute power in the world through open incentives, a properly engineered incentive structure for data would cause the best data in the world for your application to come to you. And it’s nearly impossible to shut down a system where data is coming from thousands or millions of sources. Competition between algorithms Creates open competition between models/algorithms in places where it previously didn’t exist. Picture a decentralized Facebook with thousands of competing newsfeed algorithms. Transparency in rewards Data and model providers can see they are getting the fair value of what they’ve submitted since all computation is verifiable, making them far more likely to participate. Automation Taking action on-chain and generating value directly in tokens creates an automated and trustless closed loop. Network effects Multi-sided network effects from users, data providers, and data scientists make the system self-reinforcing. The better it performs, the more capital it attracts, which means more potential payouts, which attracts more data providers and data scientists, who make the system smarter, which in turn attracts more capital, and back around again. PrivacyIn addition to the points above, a major feature is privacy. It allows 1) people to submit data that otherwise would be too private to share and 2) prevents the economic value of the data and models from leaking. If left unencrypted in the open, the data and models will be copied for free and used by others who have not contributed any work (the “free rider” problem). A partial solution to the free rider problem is to privately sell data. Even if buyers choose to resell or release the data, its value decays with time. However, this approach restricts us to short duration use cases and still creates typical privacy concerns. As a result, the more complicated but powerful approach is to use a form of secure computation. Secure computationSecure computation methods allow models to train on data without revealing the data itself. There are 3 main forms of secure computation being used and researched today: homomorphic encryption (HE), secure multi-party computation (MPC), and zero knowledge proofs (ZKPs). Multiparty computation is most commonly used for private machine learning at the moment, as homomorphic encryption tends to be too slow and it’s not obvious how to apply ZKPs to machine learning. Secure computation methods are on the bleeding edge of computer science research. They are often orders of magnitude slower than regular computation and represent the main bottleneck to the system, but have been improving in recent years. The Ultimate Recommender SystemTo illustrate the potential of private machine learning, imagine an app called “The Ultimate Recommender System”. It watches everything you do on your devices: your browsing history, everything you do in your apps, the pictures on your phone, location data, spending history, wearable sensors, text messages, cameras in your home, the camera on your future AR glasses. It then gives you recommendations: the next web site you should visit, article to read, song to listen to, or product to buy. This recommender system would be extremely potent. More than any of the existing data silos of Google, Facebook, or others could ever be because it hasa maximally longitudinal view of you and it can learn from data that otherwise would be too private to consider sharing. Similar to the prior cryptocurrency trading system example, it would work by allowing a marketplace of models focused on different areas (ex: web site recommendations, music) to compete for access to your encrypted data and recommend things to you, and perhaps even pay you for contributing your data or your attention to the recommendations generated. Google’s federated learning and Apple’s differential privacy are one step in this private machine learning direction, but still require trust, don’t allow users to directly examine their security, and keep data siloed. Current approachesIt’s very early. Few groups have anything working and most are trying to bite off one piece at a time. A simple construction from Algorithmia Research places a bounty on a model that is accurate above a certain backtesting threshold: Simple construction creating a bounty on a machine learning model by Algorithmia Research Numerai currently takes things three steps further: it uses encrypted data (although not fully homomorphically), it combines crowdsourced models into a metamodel, and it rewards models based on future performance (in this case, one week of stock trading) rather than backtesting through a native Ethereum token called Numeraire. Data scientists must stake Numeraire as skin in the game, incentivizing performance on what will happen (future performance), not what has happened (backtested performance). However, it currently centrally distributes data, limiting what feels like the most important ingredient. No one has created a successful blockchain-based marketplace for data yet. The Ocean is an early attempt to outline one. Still others are starting by building secure compute networks. Openmined is creating a multiparty compute network for training machine learning models on top of Unity that can run on any device, including game consoles (similar to Folding at Home), then expanding to secure MPC. Enigma has a similar tact. A fascinating end state would be mutually owned metamodels which give data providers and model creators ownership proportional to how much smarter they’ve made them. The models would be tokenized, could pay dividends over time, and potentially even be governed by those who trained them. A sort of mutually owned hive mind. The original Openmined video is the closest construction to this I have seen so far. What approaches are likely to work first?I won’t claim to know what precise construction is best, but I have some ideas. One thesis I use to evaluate blockchain ideas is: on a spectrum of physically native to digitally native to blockchain native, the more blockchain native, the better. The less blockchain native, the more trusted third parties are introduced, increasing complexity and reducing ease of use as a building block with other systems. Here, I think that means a system is more likely to work if the value created is quantifiable — ideally directly in the form of money, and better yet, tokens. This allows for a clean, closed-loop system. Compare the prior example of a cryptocurrency trading system to one that identifies tumors in X-rays. In the latter, you’d need to convince an insurance company that the X-ray model is valuable, negotiate how valuable, and then trust a small group of physically present people to verify the model’s success/failure. That’s not to say more clearly positive sum for society uses which are digitally native won’t emerge. Recommender systems like the one previously mentioned could be enormously useful. If attached to curation markets, they are another case where the model can take action programmatically on-chain and the system’s reward is tokens (in this case from the curation market), again creating a clean closed loop. It seems obscure now, but I expect the realm of blockchain-native tasks to expand with time. ImplicationsFirst, decentralized machine learning marketplaces can dismantle the data monopolies of the current tech giants. They standardize and commoditize the main source of value creation on the internet for the last 20 years: proprietary data networks and the strong network effects surrounding them. As a result, value creation gets moved up the stack from data to algorithms. Standardization and commoditization cycles in tech, where we are nearing the end of the networks era of data monopolies. Chart from Placeholder. Said another way, they create a direct business model for AI. Both feeding and training it. Second, they create the most powerful AI systems in the world, attracting the best data and models to them through direct economic incentives. Their strength increases through multi-sided network effects. As the Web 2.0 era data network monopolies become commoditized, they seem like a good candidate for the next re-aggregation point. We are probably a few years out from this, but it seems directionally correct. Third, as the recommender system example shows, search gets inverted. Instead of people searching for products, products search and compete for people (credit to Brad for this framing). Everyone might have personal curation markets, where recommender systems compete to place the most relevant content in their feed, and relevance is defined by the individual. Fourth, they allow us to get the same benefits of the powerful machine-learning based services we are used to from companies like Google and Facebook without giving away our data. Fifth, machine learning can advance more quickly, as any engineer can access an open marketplace for data, not just a small group of engineers in the large Web 2.0 companies. ChallengesFirst and foremost, secure computation methods are currently very slow and machine learning is already computationally expensive. On the flip side, interest in secure computation methods has started picking and performance is increasing. I have seen novel approaches with significant performance improvements to HE, MPC, and ZKPs within the last 6 months. Calculting the value a particular set of data or model provides to the metamodel is hard. Cleaning and formatting crowdsourced data is challenging. We’re likely to see some combination of tools, standardization, and small businesses pop up to solve this. Finally and ironically, the business model for creating the generalized construction of this sort of system is less clear than creating an individual instance it. This seems to be true of a lot of new crypto primitives, including curation markets. ConclusionThe combination of private machine learning with blockchain incentives can create the strongest machine intelligences in a wide variety of applications. There are significant technical challenges which feel solvable over time. Their long term potential is enormous and a welcome shift away from the current grip large internet companies have on data. They are also a bit scary — they bootstrap themselves into existence, self-reinforce, consume private data, and become almost impossible to shut down, making me wonder if creating them is summoning a more powerful Moloch than ever before. In any case, they are another example of how cryptocurrencies will slowly, then suddenly make their way into every industry. Thanks to Andrew Trask, Richard Craib, Trent McConaghy, Brad Burnham, Joel Monegro, Simon de la Rouviere, Gavin Uhma, Morten Dahl, Jonathan Libov, Matt Huang, Laura Behrens Wu, Naval Ravikant, and Daniel Gross *for conversations which contributed to this post.","categories":[],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"http://hijia.xin/tags/Hexo/"}]},{"title":"How Software Ate the Point of Sale?","slug":"How-Software-Ate-the-Point-of-Sale","date":"2018-08-19T07:35:28.000Z","updated":"2018-08-19T07:35:56.230Z","comments":true,"path":"2018/08/19/How-Software-Ate-the-Point-of-Sale/","link":"","permalink":"http://hijia.xin/2018/08/19/How-Software-Ate-the-Point-of-Sale/","excerpt":"","text":"How Software Ate the Point of Sale Or, why paying for stuff is so complicated now Tesco supermarket, 1969. Photo: Arthur Jones/Mirrorpix/Getty Images I’m standing at the counter of a Vietnamese restaurant in Berkeley, ordering a pork bun. There was a time when I knew exactly what would happen next. I’d hand over my card, the cashier would swipe it, a little receipt would curl out of a machine, I’d sign it, and I’d crumple the bottom copy into a pocket. Easy. Now all kinds of things can happen. I might stick my card directly into a point-of-sale (POS) system. Maybe I swipe; maybe the cashier does. Perhaps a screen is swiveled at me. I could enter my pin on a little purpose-built machine; I could sign with my finger on a screen; I could not have to sign or enter a pin at all. I could tap my phone on a terminal to pay. Usually, there’s a chip reader for my no-longer-new chip card. When I put the card in one of the machines, sometimes it takes four seconds; other times, I have time to pull out my phone and stare at it, which means I forget about the card until the reader begins to beep at me, at which point I pull it out, mildly flustered, as if I’d caused too much ice to pour out of a soda fountain. Ah! Okay. Sorry. The act of paying for stuff is undergoing a great transformation. The networks of machines and code that let you move your imaginary money from your bank account to a merchant are changing — the gadget that takes your card, the computer that tracks a restaurant or store’s inventory, the cards themselves (or their dematerialized abstractions inside your phone). But all this newness must remain compatible with systems that were designed 50 years ago, at the dawn of the credit-card age. This combination of old and new systems, janky and hacky and functional, is the standard state of affairs for technology, despite the many myths about how the world changes in vast leaps and revolutions. If some areas of financial technology, or Fintech, promise a new elegance, the point of sale serves as a reminder of the viscosity of the everyday technologies on which most Americans rely. If you want to divine the future of transportation, you’d probably learn more thinking about the bus than the rocket. If you want to know how money is gonna change in the future, you need to look at the cash register as much as the blockchain. But the most powerful and ambitious companies in the world have tremendous incentive to take interest in the cash register. It’s there where the two great data streams of the modern world flow together: what people do on their phones and what they buy in the physical world. In the first stream, the tech one, the rule is that data becomes money, after it is fed into machine-learning systems tuned to show you better ads. In the other, the data is money. If these two streams fully merged, a company could have a perfect ledger of what you saw and then everything you bought. The ads would get better, so you’d buy more stuff, and in buying more stuff, you’d make the ads better. Online, Facebook (and others) can already track all kinds of activity. But about 90 percent of purchases are still made IRL. Imagine the vast sums of money that could be made if every transaction became part of the ledger. Unsurprisingly, the big tech companies want a piece of this action — as do the banks, as do many start-ups and established, niche players. So Americans are living through what Bill Maurer, the director of the Institute for Money, Technology, and Financial Inclusion at the University of California, Irvine calls the “Cambrian explosion in payments.” The “point of sale” — once a poky machine or just a person with a calculator or a pencil — is now a computer like everything else, tied deeply into the operations of the restaurant or store. The labor of making a payment could fall to the cashier, as in the old days, or to me, the customer, but we’re both accessing a complex, evolved system of reckoning between banks and their attached remoras, feeding on whatever money ends up in the water. For your average fast-casual restaurant or mom-and-pop store, new point-of-sale systems promise easier bookkeeping, strategic business insights, and the kind of synoptic view of operations that is irresistible to managers. But to get all those analytics, those efficiencies, requires becoming part of the Silicon Valley world, with all the potential and pitfalls that entails. Players such as Square and Toast are fully technology companies, thinking about payments as a “stack” of different pieces of hardware and software, and they want to capture more of those layers than the banks and hardware makers of yore. Apple and Google and Amazon see locking people into their ecosystems and accumulating payment data to be as valuable as any transaction fees that can be wrung out of consumers. Which is why the biggest trends in technology — platformization, data hunger, iteration, venture-capital-backed disruption, hype — have made their way to payments. Point-of-sale systems used to change slowly, with restaurants upgrading over years or even decades. Now they can be an app on an iPad with a new UX as often as engineers can push the updates. Even the literal way that the machines plug into one another has changed. A credit-card reader almost always used to be a standalone brick of a machine, a Verifone or an Ingenico perched on a countertop. Maybe it was tied to a point-of-sale system. Maybe it sat there alone, next to an electronic cash register or someone with a big-buttoned calculator. The Squares of the world seek to internalize all the components of a transaction into a sleek screen mounted on some futuristic enclosure. The legacy companies such as Northstar and Cayanhave tried to keep pace, and new systems are proliferating as quickly as salespeople can harangue merchants into upgrading. In payments, everything is categorically more convenient than in previous decades and yet also sort of broken in new ways, which I guess makes them pretty much like everything else that has been touched by technology in recent years. The last time things changed this much, Richard Nixon was president. Take out your credit card, the piece of plastic. Run your finger over its embossed characters: your name, the expiration date. The embossing is a holdover from the earliest days of charge cards, an early-20th-century invention that was generally issued by a retailer, say a department store, and looked basically like a dog tag with raised figures enumerating your account. Stick one in an imprinter, with some carbon-copy paper, and it could create a receipt for a customer as well as one for the store. When the merchant brought the receipts to the bank, they got funds deposited in their account. It was simple, but laborious. In the mid-century, banks came to take over issuing credit cards. To know if a customer’s account could be drawn on to make a purchase, the merchant had to call the bank. I mean this literally: They had to pick up the phone and dial, according to David L. Stearns’s history of the development of payment systems. And the cards only worked within one bank’s system, which meant that every bank had to sign up the merchants who would accept their card. Banking was much more tightly regulated back then too, so in some states, there were only local banks. If you left the zip code, your card wouldn’t work. One 1950 charge card only worked “in a two-block radius” of its issuing bank. California was a little looser with its banking regulations, which made it possible for Bank of America to scale up the highly successful BankAmericard throughout the populous state. It used its many retail locations to sign up merchants and sent cards to people’s homes unsolicited. What they lost in fraud and unpaid bills, they made up for by taking a hefty cut from merchants for the ability to accept cards. By the mid-1960s, other banks began to launch widely used credit cards. But what would happen if the bank issuing the card was different from the merchant’s bank? There wasn’t a way to exchange those funds. And what about traveling to different cities, let alone states or countries? The banks knew they needed a way to authorize transactions and exchange money with each other. So they developed new systems of cooperation, which became known as Visa and Mastercard. The card networks allowed someone whose bank was in San Francisco to use their card in Los Angeles or Louisiana or La Paz. This is so basic to how money works now that it seems like it always existed. It is such an ordinary miracle, like photosynthesis, that it’s only when you slow down to explain it, as if to an alien or a child, that it becomes striking, even amazing. The prophet of this new system was Dee Hock, then a local banker whose branch had become a licensee of the BankAmericard. Hock became a central figure in knitting together the banks, not just technically, but through the organization he helped create, Visa. Hock believed that Visa was the embodiment of a new type of decentralized organization, one that would help usher in what he called the “chaordic age.” He realized, he wrote, that “everything was changing with accelerating speed” and the world needed a new kind of institution on the same level as the “nation-state, corporation, and university.” The answer, as he saw it, was in the “chaord,” “the behavior of which harmoniously blends characteristics of both chaos and order.” To create the “chaordic organization,” core notions and oppositions would have to be discarded, Hock contended. “What if the very concept of separability (mind/body — cause/effect — mankind/nature — competition/cooperation — public/ private — man/woman — you/me) is a grand delusion of Western civilization, epitomized by the industrial age; useful in certain scientiﬁc ways of knowing but fundamentally ﬂawed with respect to understanding and wisdom?” Hock wrote. Hock was not a philosopher, a countercultural icon like Stewart Brand, or some theorist at the Santa Fe Institute (although he did speak there). He was the first CEO of Visa, which he called a “transcendental organization linking together in wholly new ways an unimaginable complex of diverse institutions and individuals.” It did this by emptying out the old idea of money as “hard” currency, bills and paper checks and gold, subbing in a new definition of money: “alphanumeric data in the form of arranged energy,” bits in a computer. And using this idea, Visa built a new standard for computers to talk about money — now known as ISO 8583. Like Internet Protocol or containerization, this low-level agreement on how to move things around the modern world came to organize vast swaths of economic activity. Put all three of these late 1960s innovations together and you have the infrastructure of globalization. “Visa provides an infrastructure … in which multiple competing financial institutions can cooperate, just enough, to provide a service that none could have realistically provided alone,” Stearns wrote. “In short, Visa makes money move.” Visa wasn’t the only such organization. A different consortium of financial institutions banded together into Master Charge, which became Mastercard. Then those systems learned to work together (perhaps too well, according to retailers who have long-running antitrust litigation against the companies). But there was one other key step in creating the modern point-of-sale system. Flip your card over now. Take a look at the magnetic stripe toward the top. It’s what made your card machine-readable. The system was developed by IBM in the late 1960s, and according to one of its architects, “The original information standards — the way the data is physically laid out on the mag stripe — has survived every migration of transaction media, from mag-stripe cards to smart cards, from smart cards to smartphones.” The stripe itself is not unlike the tape in the cassettes you put in a boom box. But instead of encoding music in a form that can be played back from your shoulder, that little strip of iron oxide contains your account number. Swiping it through a reader plays it back. That’s why Square’s original card reader was designed attached to the headphone jack: The whole device merely sent the signal from the audio read head to the mic input, and then the app could take it from there. (Some beautiful nerds took advantage of this capability and converted the Square reader into a kind of instrument.) “The payment card is merely an access device, a means for identifying the cardholder to the vast electronic financial network that lies behind it,” Stearns wrote in an essay in Paid: Tales of Dongles, Checks, and Other Money Stuff. Your card is a fob for walking into the vast digital storehouse where the “alphanumeric data” formerly known as money is kept. From the very beginning, American credit cards have been relatively insecure. If Square can build a dirt-cheap way to read your credit card, so can fraudsters who built devices called “skimmers” which can steal the data off cards, reencode it onto a new one, and, voila, someone is swiping their way around with your account. You might think your signature is a security measure, but it’s basically theater. The only real security in the system is on the network level, where banks process transaction data to look for “suspicious activity.” Chip-card technology — known as EMV in the industry — is more secure. The data can’t be easily skimmed from the chip, as it stores important information in an encrypted format. For these reasons, it’s been standard in Europe for more than two decades. But not in the United States. Some of that was timing. One, if you installed a brand-new system in the 1970s, you probably didn’t want to buy all new hardware in the 1980s. Two, swiping is super fast and super easy. “Swiping is a really good experience,” said Jesse Dorogusker, the head of hardware at Square. “It sets a really high bar for convenience and speed.” Even if Square can spend the development resources to get its chip-card processing down to three seconds, other systems might take much longer — try counting, you might get to 10 or even 12 sometimes. “It makes for an inconsistent ecosystem,” Dorogusker said. Three, IBM, the developer of the mag-stripe card, was in the database business, so promoting more back-end data processing seemed like a good idea to them. And so, authorization and fraud detection took place in the bank’s mainframes, while the reader and the card were basically dumb access devices hooked up to a network. This was convenient for customers, but if you were a merchant, not only did you need a special account with a bank that allowed you to transact with cards, but you also had to deal with the whole front-end to that system. As Lana Swartz, a media-studies professor at the University of Virginia and the co-editor of Paid, said to me, in the era before anyone was on the internet, accepting cards required “putting a modem in your shop, maintaining this dial-up thing, maintaining swipe equipment, dealing with errors.” This gave rise to the POS industry as we now know it. The banks were not going to develop and service the ecosystem of hardware and modems necessary to accept credit cards, and so a whole constellation of businesses rose up to offer these services to mom-and-pop players. Over decades, Ingenico (mostly in Europe) and Verifone (mostly in the U.S.) came to dominate the actual payment hardware, and different point-of-sale hardware and software systems took over different niches. Then middlemen called Independent Sales Organizations, or ISOs, popped up to simplify the complexity of this world for someone who just wanted to sell futons or run a hamburger shop. They created whole packages of card-processing machines, POS systems, and accounts, which they’d roll up into a “solution” for individual merchants, and they also become responsible for assuming the risk of bad transactions. In other words, the ISOs are the complex, sometimes essential, sometimes shady layer between your corner bodega and the world of global finance. The point of sale, to this day, is shaped by what these companies offer. Philip Parker, who runs cardpaymentoptions.com, has dedicated the last decade of his life to figuring out what a merchant should do, faced with these realities. When he was in college, he got hired by an ISO, and when he started going into stores, he’d get run out by merchants angry at the last ISO guy who screwed them. “These business owners would be yelling at me, ‘I’ve already been burned by you guys one time!’” Parker told me. Basically, if you got laid off from the used-car-sales lot, this industry might be your next gig. Parker has now reviewed dozens of different card-payment systems from all kinds of different companies. There is huge variability in the fees that merchants have to pay, he told me, not just based on their systems but the cards that customers use. According to Cayan, a provider of point-of-sale equipment,there are “more than 700” different rates for different cards, transaction types, retail environments, and other factors. “My belief is that the confusion and complication are there on purpose because it allows these financial institutions and ISOs to make more money and charge more without anyone understanding what’s happening,” Parker said. It’s dizzying. The contracts ISOs have merchants sign also slow down the speed at which restaurants upgrade their equipment. They can get locked into multiyear leases on the one hand, and on the other it can be such a hassle to get the point-of-sale equipment set up that once it’s working, they don’t want to mess with anything. Josh Bays, a San Francisco resident, has worked in retail and restaurants for the past decade. One place he works uses Square. The other uses a legacy system that runs off Windows 95. “It runs about as slow as you’d expect,” Bays told me. “It’s a four-hour ordeal to add potato salad to the menu.” But the owners don’t want to change that system out for something new and potentially better. “They know it will continue to work for as long as the hardware does,” Bays said. Whereas with a new system, they’ll be on the hook for a lease. “It’s kind of analogous to how Adobe doesn’t sell Photoshop anymore. They sell a license,” he said. “You never actually own anything.” Even the chip readers, which would presumably reduce fraud, don’t always seem worth the investment to small-business owners. “There is nowhere I’ve ever worked where the management says, ‘I want to invest in infrastructure,’” Bays said. So they do it when they have to or when they finally get around to it. There are now dozens of point-of-sale systems offering different kinds of payment integrations and experiences. At their best, they integrate a whole restaurant’s or store’s business. They make it possible to take online orders and simplify accounting. They can keep track of important customers and offer them incentives. At worst, they present unwanted complexity, new problems, and the disruption of systems that worked. “It’s all kind of a complete mess,” said Maurer, the anthropologist. “There are so many different systems. So many different POS manufacturers each promising different services. So many different payment systems and protocols.” It’s not just outside scholars who have taken this position. The Aite Group, a financial-services research firm, found in a 2017 report that the POS is moving from “a highly concentrated industry” into one that’s wilder, a “new reality of an open ecosystem facilitating innovation and competition.” Even the legacy industry-standard POS system for restaurants, NCR’s Aloha, would like to be known as something more. “The way we’ve been talking about Aloha in the last few years is as a platform of sale,” said Jon Lawrence, a senior director at NCR. “It’s more than a play on words: If you think about what Facebook has done, or Uber or Airbnb, these are software platforms that have helped transform industries.” This is a crazy world that requires hundreds of thousands of small businesses to work through hundreds of vendors to reach thousands of banks. Every company is trying to extract some bits (of data, of money) from every single transaction, building fortunes out of pennies. That’s why Google Pay and Apple Pay didn’t take off like Facebook or Uber. There are just too many human hands reaching for pockets that need to get on board. And it’s into this environment that Silicon Valley companies — and other VC-backed start-ups like Boston’s Toast — have plunged. Square could hack the technology of the credit-card reader, but the greater system’s complexity affords no elegant solution. So, the next time you’re waiting for the chip-card reader to beep at you, consider that money has been data for a long time, arranged energy, but like every other part of the world that software is digesting, the gap between the mega-trend and the lived reality is where the money is made.","categories":[],"tags":[{"name":"tutorial","slug":"tutorial","permalink":"http://hijia.xin/tags/tutorial/"}]},{"title":"A code demo","slug":"A-code-demo","date":"2018-08-19T04:29:34.000Z","updated":"2018-08-19T04:29:43.069Z","comments":true,"path":"2018/08/19/A-code-demo/","link":"","permalink":"http://hijia.xin/2018/08/19/A-code-demo/","excerpt":"","text":"123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139140141142143144145146147148149150151152153154155156157158159160161162163164165166167168169170171172173174175176177178179180181# Copyright 2015 Google Inc. All Rights Reserved.## Licensed under the Apache License, Version 2.0 (the \"License\");# you may not use this file except in compliance with the License.# You may obtain a copy of the License at## http://www.apache.org/licenses/LICENSE-2.0## Unless required by applicable law or agreed to in writing, software# distributed under the License is distributed on an \"AS IS\" BASIS,# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.# See the License for the specific language governing permissions and# limitations under the License.# ==============================================================================\"\"\"Functions for downloading and reading MNIST data.\"\"\"from __future__ import absolute_importfrom __future__ import divisionfrom __future__ import print_functionimport gzipimport osimport tensorflow.python.platformimport numpyfrom six.moves import urllibfrom six.moves import xrange # pylint: disable=redefined-builtinimport tensorflow as tfSOURCE_URL = 'http://yann.lecun.com/exdb/mnist/'def maybe_download(filename, work_directory): \"\"\"Download the data from Yann's website, unless it's already here.\"\"\" if not os.path.exists(work_directory): os.mkdir(work_directory) filepath = os.path.join(work_directory, filename) if not os.path.exists(filepath): filepath, _ = urllib.request.urlretrieve(SOURCE_URL + filename, filepath) statinfo = os.stat(filepath) print('Successfully downloaded', filename, statinfo.st_size, 'bytes.') return filepathdef _read32(bytestream): dt = numpy.dtype(numpy.uint32).newbyteorder('&gt;') return numpy.frombuffer(bytestream.read(4), dtype=dt)[0]def extract_images(filename): \"\"\"Extract the images into a 4D uint8 numpy array [index, y, x, depth].\"\"\" print('Extracting', filename) with gzip.open(filename) as bytestream: magic = _read32(bytestream) if magic != 2051: raise ValueError( 'Invalid magic number %d in MNIST image file: %s' % (magic, filename)) num_images = _read32(bytestream) rows = _read32(bytestream) cols = _read32(bytestream) buf = bytestream.read(rows * cols * num_images) data = numpy.frombuffer(buf, dtype=numpy.uint8) data = data.reshape(num_images, rows, cols, 1) return datadef dense_to_one_hot(labels_dense, num_classes=10): \"\"\"Convert class labels from scalars to one-hot vectors.\"\"\" num_labels = labels_dense.shape[0] index_offset = numpy.arange(num_labels) * num_classes labels_one_hot = numpy.zeros((num_labels, num_classes)) labels_one_hot.flat[index_offset + labels_dense.ravel()] = 1 return labels_one_hotdef extract_labels(filename, one_hot=False): \"\"\"Extract the labels into a 1D uint8 numpy array [index].\"\"\" print('Extracting', filename) with gzip.open(filename) as bytestream: magic = _read32(bytestream) if magic != 2049: raise ValueError( 'Invalid magic number %d in MNIST label file: %s' % (magic, filename)) num_items = _read32(bytestream) buf = bytestream.read(num_items) labels = numpy.frombuffer(buf, dtype=numpy.uint8) if one_hot: return dense_to_one_hot(labels) return labelsclass DataSet(object): def __init__(self, images, labels, fake_data=False, one_hot=False, dtype=tf.float32): \"\"\"Construct a DataSet. one_hot arg is used only if fake_data is true. `dtype` can be either `uint8` to leave the input as `[0, 255]`, or `float32` to rescale into `[0, 1]`. \"\"\" dtype = tf.as_dtype(dtype).base_dtype if dtype not in (tf.uint8, tf.float32): raise TypeError('Invalid image dtype %r, expected uint8 or float32' % dtype) if fake_data: self._num_examples = 10000 self.one_hot = one_hot else: assert images.shape[0] == labels.shape[0], ( 'images.shape: %s labels.shape: %s' % (images.shape, labels.shape)) self._num_examples = images.shape[0] # Convert shape from [num examples, rows, columns, depth] # to [num examples, rows*columns] (assuming depth == 1) assert images.shape[3] == 1 images = images.reshape(images.shape[0], images.shape[1] * images.shape[2]) if dtype == tf.float32: # Convert from [0, 255] -&gt; [0.0, 1.0]. images = images.astype(numpy.float32) images = numpy.multiply(images, 1.0 / 255.0) self._images = images self._labels = labels self._epochs_completed = 0 self._index_in_epoch = 0 @property def images(self): return self._images @property def labels(self): return self._labels @property def num_examples(self): return self._num_examples @property def epochs_completed(self): return self._epochs_completed def next_batch(self, batch_size, fake_data=False): \"\"\"Return the next `batch_size` examples from this data set.\"\"\" if fake_data: fake_image = [1] * 784 if self.one_hot: fake_label = [1] + [0] * 9 else: fake_label = 0 return [fake_image for _ in xrange(batch_size)], [ fake_label for _ in xrange(batch_size)] start = self._index_in_epoch self._index_in_epoch += batch_size if self._index_in_epoch &gt; self._num_examples: # Finished epoch self._epochs_completed += 1 # Shuffle the data perm = numpy.arange(self._num_examples) numpy.random.shuffle(perm) self._images = self._images[perm] self._labels = self._labels[perm] # Start next epoch start = 0 self._index_in_epoch = batch_size assert batch_size &lt;= self._num_examples end = self._index_in_epoch return self._images[start:end], self._labels[start:end]def read_data_sets(train_dir, fake_data=False, one_hot=False, dtype=tf.float32): class DataSets(object): pass data_sets = DataSets() if fake_data: def fake(): return DataSet([], [], fake_data=True, one_hot=one_hot, dtype=dtype) data_sets.train = fake() data_sets.validation = fake() data_sets.test = fake() return data_sets TRAIN_IMAGES = 'train-images-idx3-ubyte.gz' TRAIN_LABELS = 'train-labels-idx1-ubyte.gz' TEST_IMAGES = 't10k-images-idx3-ubyte.gz' TEST_LABELS = 't10k-labels-idx1-ubyte.gz' VALIDATION_SIZE = 5000 local_file = maybe_download(TRAIN_IMAGES, train_dir) train_images = extract_images(local_file) local_file = maybe_download(TRAIN_LABELS, train_dir) train_labels = extract_labels(local_file, one_hot=one_hot) local_file = maybe_download(TEST_IMAGES, train_dir) test_images = extract_images(local_file) local_file = maybe_download(TEST_LABELS, train_dir) test_labels = extract_labels(local_file, one_hot=one_hot) validation_images = train_images[:VALIDATION_SIZE] validation_labels = train_labels[:VALIDATION_SIZE] train_images = train_images[VALIDATION_SIZE:] train_labels = train_labels[VALIDATION_SIZE:] data_sets.train = DataSet(train_images, train_labels, dtype=dtype) data_sets.validation = DataSet(validation_images, validation_labels, dtype=dtype) data_sets.test = DataSet(test_images, test_labels, dtype=dtype) return data_sets","categories":[],"tags":[{"name":"code","slug":"code","permalink":"http://hijia.xin/tags/code/"}]},{"title":"How to add an tags or categories?","slug":"How-to-add-an-tags-or-categories","date":"2018-08-18T02:34:21.000Z","updated":"2018-08-19T08:25:21.530Z","comments":true,"path":"2018/08/18/How-to-add-an-tags-or-categories/","link":"","permalink":"http://hijia.xin/2018/08/18/How-to-add-an-tags-or-categories/","excerpt":"","text":"If you want to add an tag such as Hexo and the categorie we choose is tutorial, just add some change like this 1234tags: - Hexocategories: - tutorial","categories":[],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"http://hijia.xin/tags/Hexo/"},{"name":"tutorial","slug":"tutorial","permalink":"http://hijia.xin/tags/tutorial/"}]},{"title":"Begin","slug":"Begin","date":"2018-08-17T13:39:26.000Z","updated":"2018-08-19T00:28:47.124Z","comments":true,"path":"2018/08/17/Begin/","link":"","permalink":"http://hijia.xin/2018/08/17/Begin/","excerpt":"开始。。。","text":"开始。。。 终于可以用了。 ！！！ 如下图 为了几个空格。。。 崩溃了","categories":[{"name":"start","slug":"start","permalink":"http://hijia.xin/categories/start/"}],"tags":[{"name":"begin","slug":"begin","permalink":"http://hijia.xin/tags/begin/"}]}]}